# MEMBACA FILE HTML

Pandas Menyediakan fungsi read_html(link/url)

CONTOH:

In [10]:
import pandas as pd

url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list"

df = pd.read_html(url)[0]
print(df)

                         Bank NameBank       CityCity StateSt  CertCert  \
0                        Citizens Bank       Sac City      IA      8758
1             Heartland Tri-State Bank        Elkhart      KS     25851
2                  First Republic Bank  San Francisco      CA     59017
3                       Signature Bank       New York      NY     57053
4                  Silicon Valley Bank    Santa Clara      CA     24735
..                                 ...            ...     ...       ...
563                 Superior Bank, FSB       Hinsdale      IL     32646
564                Malta National Bank          Malta      OH      6629
565    First Alliance Bank & Trust Co.     Manchester      NH     34264
566  National State Bank of Metropolis     Metropolis      IL      3815
567                   Bank of Honolulu       Honolulu      HI     21029

                 Acquiring InstitutionAI Closing DateClosing  FundFund
0              Iowa Trust & Savings Bank    November 3, 2023     10545
1                 Dream First Bank, N.A.       July 28, 2023     10544
2              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
3                    Flagstar Bank, N.A.      March 12, 2023     10540
4    Firstâ€“Citizens Bank & Trust Company      March 10, 2023     10539
..                                   ...                 ...       ...
563                Superior Federal, FSB       July 27, 2001      6004
564                    North Valley Bank         May 3, 2001      4648
565  Southern New Hampshire Bank & Trust    February 2, 2001      4647
566              Banterra Bank of Marion   December 14, 2000      4646
567                   Bank of the Orient    October 13, 2000      4645

[568 rows x 7 columns]

# MEMBACA FILE CSV

Untuk membaca file CSV pandas menyedikan fungsi read_csv

Contoh :

In [ ]:
import pandas as pd

df = pd.read_csv("data.csv", delimiter=",")

# MEMBACA FILE XLSX dan XLS

Untuk membaca file excel atau spreadsheet, pandas menyediakan fungsi read_excel()

Contoh:

In [ ]:
import pandas as pd

df= pd.read_excel("data.xlxs", sheet_name = "Sheet1")

# MEMBACA FILE JSON

Untuk membaca file json, pandas menyediakan fungsi read_json()

Contoh :

In [ ]:
import pandas as pd

df = pd.read_json(json_file.js)

# MEMBACA FILE XML

Untuk membaca file XML, pandas menyediakan fungsi read_xml()

Contoh :

In [2]:
import pandas as pd

df = pd.read_xml("https://www.w3schools.com/xml/books.xml")
print(df)

   category              title                  author  year  price      cover
0   cooking   Everyday Italian     Giada De Laurentiis  2005  30.00       None
1  children       Harry Potter            J K. Rowling  2005  29.99       None
2       web  XQuery Kick Start  Vaidyanathan Nagarajan  2003  49.99       None
3       web       Learning XML             Erik T. Ray  2003  39.95  paperback

# MEMBACA FILE SQL

Untuk membaca file pada SQL, pandas menyediakan 3 fungsi yaitu : 

1. read_sql_table()untuk membaca SQL database table dan mempresentasikannya ke dalam bentuk pandas DataFrame.

2. read_sql_query()untuk membaca SQL query dan mempresentasikannya ke dalam bentuk pandas DataFrame.

3. read_sql()untuk membaca SQL query atau table dan mempresentasikannya ke dalam bentuk pandas DataFrame.

### Contoh Membaca SQL Database Table

In [ ]:
import pandas as pd
import sqlalchemy as sqla 

db  = sqla.create_engine("sql://mydata.sqlite")

pd.read_sql_table("table_name", db)

print(db)

### Contoh Membaca SQL Query

In [ ]:
import pandas as pd
import sqlalchemy as sqla

db = sqla.create_engine("sqlite://mydata.sqlite")

pd.read_sql_query("SELECT * FROM table_name", db)

print(db)

### Contoh Membaca SQL Query atau Table

In [ ]:
import pandas as pd
import sqlalchemy as sqla

db = sqla.create_engine("sqlite://mydata.sqlite")

pd.read_sql("SELECT * FROM table_name", db)

# MENGGABUNGKAN BEBERAPA DATA MENJADI SATU DATA FRAME

Pada database kita perlu untuk menghubungkan beberapa table pada data dengan
menggunakan teknik merge atau join. Ini merupakan teknik untuk menggabungkan
dua tabel data menggunakan primary key (PK) dan foreign key (FK).

pandas menyediakan fungsi merge() untuk menggabungkan table antar 2 atau lebih
data.

# CONTOH :

In [ ]:
import pandas as pd

product_df = pd.read_csv("product.csv")
order_df = pd.read_csv("order.csv")

new_order_df = pd.merge(left = product_df, right = order_df, how="inner",
                        left_on = "product_id", right_on = "product_id")

Kode di atas akan menghasilkan sebuah DataFrame baru yang hanya mengambil nilai yang bersesuaian dari kedua DataFrame (product_df dan orders_df) tersebut. Proses ini dilakukan dengan menyesuaikan nilai pada kolom product_id yang berperan sebagai primary key dari product_df dan foreign key dari orders_df